# ___________________________________________________________________________________________________________________________
# Задачи:
# ___________________________________________________________________________________________________________________________
# 28.12.2023-11.01.2024
   
# - Старт проекта.
# - Понять какие файлы и директории для чего служат в django.
# - Завести БД postgres (подключение + создание моделей, таблиц).

# Если позволяет время и успеваешь:
# - Познакомиться с админкой.
# - Вывести информацию в админ панель из таблиц.



# ___________________________________________________________________________________________________________________________
# Задачи:
# ___________________________________________________________________________________________________________________________
# 11.01.2024

# - понять как выгружать проект на github
# - создать новый Джанго проект и понять как его именовать 
#   (посмотреть репозитории на github или gitlab), затем выгрузить на гитхаб
  
# - по БД - переименовать таблицы и понять какие таблицы нужно создать, 
#   затем эти таблицы связать через «foreigh key», также добавить 
#   в таблицу “Users” столбец с датой регистрации пользователя “created_at”
  
# - реализовать авторизацию через JWT, посмотреть также как реализуется авторизация через email